app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM `products`

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 953125641)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 953125641)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `updated_at`, `price`, `quantity`, `description`, `image`, `created_at`) VALUES(NULL, '2009-09-05 08:03:22', NULL, NULL, NULL, NULL, '2009-09-05 08:03:22')

  def update
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 953125641)

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM `products` WHERE (`products`.`id` = 953125641)
DELETE FROM `products` WHERE `id` = 953125641